brew "ant"                              # Java build tool
brew "bash"                             # Updated Bash shell
brew "bat"                              # cat clone with syntax highlighting
brew "broot"                            # Interactive tree file manager
brew "btop"                             # Resource monitor
brew "ccache"                           # Compiler cache
brew "cloc"                             # Count lines of code
brew "cmake"                            # Cross-platform build system
brew "crystal"                          # Crystal programming language
brew "ctop"                             # Container metrics viewer
brew "difftastic"                       # Structural diff tool
brew "docker", link: false              # Container runtime
brew "dockly"                           # TUI for Docker container management
brew "duckdb"                           # In-process analytical database
brew "dust"                             # Intuitive disk usage tool
brew "elixir"                           # Elixir programming language
brew "emscripten"                       # C/C++ to WebAssembly compiler
brew "eza"                              # Modern ls replacement
brew "ffmpeg"                           # Audio/video processing toolkit
brew "flox"                             # Nix-based dev environment manager
brew "gh"                               # GitHub CLI
brew "git-lfs"                          # Git Large File Storage
brew "gnupg"                            # GPG encryption suite
brew "gradle"                           # JVM build tool
brew "gsasl"                            # GNU SASL authentication library
brew "helix"                            # Modal text editor
brew "htop"                             # Interactive process viewer
brew "inlyne"                           # GPU-powered Markdown viewer
brew "iperf3"                           # Network bandwidth measurement tool
brew "jless"                            # JSON viewer for the terminal
brew "jq"                               # JSON processor
brew "jsonlint"                         # JSON validator
brew "just"                             # Command runner
brew "krb5"                             # Kerberos authentication
brew "llvm"                             # Compiler infrastructure
brew "lynx"                             # Terminal web browser
brew "macmon"                           # Mac system monitor for Apple Silicon
brew "mdcat"                            # Markdown renderer for the terminal
brew "minikube"                         # Local Kubernetes cluster
brew "mise"                             # Dev tool version manager
brew "ncdu"                             # Disk usage analyzer with ncurses UI
brew "nim"                              # Nim programming language
brew "node"                             # Node.js JavaScript runtime
brew "python@3.12"                      # Python interpreter
brew "sccache"                          # Shared compiler cache
brew "the_silver_searcher"              # ag code search tool
brew "thrift"                           # RPC serialization framework
brew "tig"                              # Text-mode Git interface
brew "tldr"                             # Simplified man pages
brew "tmux"                             # Terminal multiplexer
brew "toast"                            # Containerized build tool
brew "tree"                             # Directory listing as a tree
brew "uv"                               # Fast Python package manager
brew "vcpkg"                            # C/C++ dependency manager
brew "wasmer"                           # WebAssembly runtime
brew "watch"                            # Run commands periodically
brew "wget"                             # HTTP file downloader
brew "yt-dlp"                           # Video downloader
brew "z3"                               # SMT theorem prover
brew "zellij"                           # Terminal workspace and multiplexer
brew "zig"                              # Zig programming language
brew "zoxide"                           # Smarter cd command
cask "firefox"                          # Web browser
cask "ghostty"                          # GPU-accelerated terminal emulator
cask "httpie-desktop"                   # HTTP client GUI
cask "iterm2"                           # Terminal emulator
cask "slack"                            # Team messaging
cask "spectacle"                        # Window management via keyboard shortcuts
cask "spotify"                          # Music streaming
cask "tailscale-app"                    # Tailscale VPN client
cask "visual-studio-code"              # Code editor
cask "vlc"                              # Media player
vscode "dtsvet.vscode-wasm"                                        # WebAssembly syntax support
vscode "ms-vscode-remote.remote-containers"                        # Dev Containers support
vscode "ms-vscode-remote.remote-ssh"                               # Remote SSH development
vscode "ms-vscode-remote.remote-ssh-edit"                          # Remote SSH file editing
vscode "ms-vscode.cmake-tools"                                     # CMake integration
vscode "ms-vscode.cpptools"                                        # C/C++ IntelliSense and debugging
vscode "ms-vscode.remote-explorer"                                 # Remote target browser
vscode "redhat.java"                                               # Java language support
vscode "rust-lang.rust-analyzer"                                   # Rust language server
vscode "scala-lang.scala"                                          # Scala language support
vscode "sdras.night-owl"                                           # Night Owl color theme
vscode "tailscale.vscode-tailscale"                                # Tailscale integration
vscode "tamasfe.even-better-toml"                                  # TOML language support
vscode "twxs.cmake"                                                # CMake syntax highlighting
vscode "visualstudioexptteam.intellicode-api-usage-examples"       # AI-assisted code examples
vscode "visualstudioexptteam.vscodeintellicode"                    # AI-assisted IntelliSense
vscode "vscjava.vscode-gradle"                                     # Gradle integration
vscode "vscjava.vscode-java-debug"                                 # Java debugger
vscode "vscjava.vscode-java-dependency"                            # Java dependency viewer
vscode "vscjava.vscode-java-pack"                                  # Java extension pack
vscode "vscjava.vscode-java-test"                                  # Java test runner
vscode "vscjava.vscode-maven"                                      # Maven integration
vscode "yzhang.markdown-all-in-one"                                # Markdown editing tools
vscode "ziglang.vscode-zig"                                        # Zig language support
