brew "ant"
brew "bash"
brew "bat"
brew "btop"
brew "ccache"
brew "cloc"
brew "cmake"
brew "z3"
brew "llvm"
brew "crystal"
brew "ctop"
brew "difftastic"
brew "docker", link: false
brew "node"
brew "dockly"
brew "duckdb"
brew "dust"
brew "elixir"
brew "python@3.12"
brew "emscripten"
brew "eza"
brew "ffmpeg"
brew "gh"
brew "git-lfs"
brew "gnupg"
brew "gradle"
brew "gsasl"
brew "helix"
brew "htop"
brew "inlyne"
brew "iperf3"
brew "jless"
brew "jq"
brew "jsonlint"
brew "just"
brew "krb5"
brew "lynx"
brew "macmon"
brew "mdcat"
brew "minikube"
brew "mise"
brew "ncdu"
brew "nim"
brew "sccache"
brew "the_silver_searcher"
brew "thrift"
brew "tig"
brew "tldr"
brew "tmux"
brew "toast"
brew "tree"
brew "uv"
brew "vcpkg"
brew "wasmer"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zellij"
brew "zig"
brew "zoxide"
cask "firefox"
cask "ghostty"
cask "httpie-desktop"
cask "iterm2"
cask "slack"
cask "spectacle"
cask "spotify"
cask "tailscale-app"
cask "visual-studio-code"
cask "vlc"
brew "broot" 
vscode "dtsvet.vscode-wasm"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "sdras.night-owl"
vscode "tailscale.vscode-tailscale"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
